### Terraform Plan 📋
**Environment:** `dev`
**Result:** `failure`

<details><summary>Show Plan</summary>

```terraform
module.alb_controller.data.aws_caller_identity.current: Reading...
module.monitoring_storage[0].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.security.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb_controller.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.monitoring_storage[0].data.aws_partition.current: Reading...
module.alb_controller.data.aws_partition.current: Read complete after 0s [id=aws]
module.monitoring_storage[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.monitoring_storage[0].data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.alb_controller.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.12.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "replicas"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
    }

  # module.alb_controller.aws_iam_policy.alb_controller will be created
  + resource "aws_iam_policy" "alb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for AWS Load Balancer Controller"
      + id               = (known after apply)
      + name             = "eks-portfolio-Dev-alb-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeVpcEndpoints",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all         = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.alb_controller.aws_iam_role.alb_controller will be created
  + resource "aws_iam_role" "alb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-alb-controller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.alb_controller.aws_iam_role_policy_attachment.alb_controller will be created
  + resource "aws_iam_role_policy_attachment" "alb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-portfolio-Dev-alb-controller-role"
    }

  # module.alb_controller.helm_release.alb_controller will be created
  + resource "helm_release" "alb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.10.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "eks-portfolio-Dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-west-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ebs_csi[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ebs_csi[0].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.ebs_csi[0].aws_iam_role.ebs_csi will be created
  + resource "aws_iam_role" "ebs_csi" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ebs_csi[0].aws_iam_role_policy_attachment.ebs_csi will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-portfolio-Dev-ebs-csi-driver"
    }

  # module.ebs_csi[0].helm_release.ebs_csi_driver will be created
  + resource "helm_release" "ebs_csi_driver" {
      + atomic                     = false
      + chart                      = "aws-ebs-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-ebs-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/aws-ebs-csi-driver"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.37.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.serviceAccount.name"
          + value = "ebs-csi-controller-sa"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "node.tolerateAllTaints"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.ebs_csi[0].kubernetes_annotations.remove_gp2_default will be created
  + resource "kubernetes_annotations" "remove_gp2_default" {
      + annotations   = {
          + "storageclass.kubernetes.io/is-default-class" = "false"
        }
      + api_version   = "storage.k8s.io/v1"
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)
      + kind          = "StorageClass"

      + metadata {
          + name = "gp2"
        }
    }

  # module.ebs_csi[0].kubernetes_storage_class_v1.gp3 will be created
  + resource "kubernetes_storage_class_v1" "gp3" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = (known after apply)
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "ebs.csi.aws.com"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + annotations      = {
              + "storageclass.kubernetes.io/is-default-class" = "true"
            }
          + generation       = (known after apply)
          + name             = "gp3"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.eks will be created
  + resource "aws_cloudwatch_log_group" "eks" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/eks-portfolio-Dev/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.eks.aws_eks_access_entry.admin will be created
  + resource "aws_eks_access_entry" "admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-portfolio-Dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region            = "eu-west-1"
      + tags              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all          = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.admin will be created
  + resource "aws_eks_access_policy_association" "admin" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-portfolio-Dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region        = "eu-west-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-portfolio-Dev"
      + platform_version              = (known after apply)
      + region                        = "eu-west-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                      = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + version                       = "1.29"

      + access_config (known after apply)

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-portfolio-Dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t4g.medium",
        ]
      + labels                 = {
          + "environment" = "Dev"
          + "role"        = "general"
        }
      + node_group_name        = "eks-portfolio-Dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "eu-west-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "CostCenter"                                  = "development"
          + "Environment"                                 = "Dev"
          + "ManagedBy"                                   = "terraform"
          + "Owner"                                       = "constantinious"
          + "Project"                                     = "eks-portfolio"
          + "Service"                                     = "eks-platform"
          + "Team"                                        = "platform"
          + "k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"           = "true"
        }
      + tags_all               = {
          + "CostCenter"                                  = "development"
          + "Environment"                                 = "Dev"
          + "ManagedBy"                                   = "terraform"
          + "Owner"                                       = "constantinious"
          + "Project"                                     = "eks-portfolio"
          + "Repository"                                  = "eks-portfolio-project"
          + "Service"                                     = "eks-platform"
          + "Team"                                        = "platform"
          + "k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"           = "true"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 5
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-oidc-provider"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-oidc-provider"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks_nodes will be created
  + resource "aws_iam_role" "eks_nodes" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy" "cluster_autoscaler" {
      + id          = (known after apply)
      + name        = "eks-portfolio-Dev-cluster-autoscaler-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "eks:DescribeNodegroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-portfolio-Dev-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_container_registry_read will be created
  + resource "aws_iam_role_policy_attachment" "eks_container_registry_read" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_ssm_managed_instance will be created
  + resource "aws_iam_role_policy_attachment" "eks_ssm_managed_instance" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-portfolio-Dev-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_launch_template.eks_nodes will be created
  + resource "aws_launch_template" "eks_nodes" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "eks-portfolio-Dev-nodes-"
      + region          = "eu-west-1"
      + tags            = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + kms_key_id                 = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CostCenter"  = "development"
              + "Environment" = "Dev"
              + "ManagedBy"   = "terraform"
              + "Name"        = "eks-portfolio-Dev-worker-node"
              + "Owner"       = "constantinious"
              + "Project"     = "eks-portfolio"
              + "Service"     = "eks-platform"
              + "Team"        = "platform"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "CostCenter"  = "development"
              + "Environment" = "Dev"
              + "ManagedBy"   = "terraform"
              + "Name"        = "eks-portfolio-Dev-worker-volume"
              + "Owner"       = "constantinious"
              + "Project"     = "eks-portfolio"
              + "Service"     = "eks-platform"
              + "Team"        = "platform"
            }
        }
    }

  # module.monitoring_storage[0].aws_iam_role.loki will be created
  + resource "aws_iam_role" "loki" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-loki"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.monitoring_storage[0].aws_iam_role.tempo will be created
  + resource "aws_iam_role" "tempo" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-tempo"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.monitoring_storage[0].aws_iam_role_policy.loki_s3 will be created
  + resource "aws_iam_role_policy" "loki_s3" {
      + id          = (known after apply)
      + name        = "eks-portfolio-Dev-loki-s3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.monitoring_storage[0].aws_iam_role_policy.tempo_s3 will be created
  + resource "aws_iam_role_policy" "tempo_s3" {
      + id          = (known after apply)
      + name        = "eks-portfolio-Dev-tempo-s3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.monitoring_storage[0].aws_s3_bucket.loki will be created
  + resource "aws_s3_bucket" "loki" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "eks-portfolio-Dev-loki-992382750905"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-loki"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-loki"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.monitoring_storage[0].aws_s3_bucket.tempo will be created
  + resource "aws_s3_bucket" "tempo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "eks-portfolio-Dev-tempo-992382750905"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-tempo"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-tempo"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.monitoring_storage[0].aws_s3_bucket_lifecycle_configuration.loki will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "loki" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "eu-west-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-logs"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 14
              + expired_object_delete_marker = false
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.monitoring_storage[0].aws_s3_bucket_lifecycle_configuration.tempo will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "tempo" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "eu-west-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-traces"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 3
              + expired_object_delete_marker = false
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.monitoring_storage[0].aws_s3_bucket_public_access_block.loki will be created
  + resource "aws_s3_bucket_public_access_block" "loki" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-1"
      + restrict_public_buckets = true
    }

  # module.monitoring_storage[0].aws_s3_bucket_public_access_block.tempo will be created
  + resource "aws_s3_bucket_public_access_block" "tempo" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-1"
      + restrict_public_buckets = true
    }

  # module.monitoring_storage[0].aws_s3_bucket_server_side_encryption_configuration.loki will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "loki" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-1"

      + rule {
          + blocked_encryption_types = []
          + bucket_key_enabled       = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "aws:kms"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.monitoring_storage[0].aws_s3_bucket_server_side_encryption_configuration.tempo will be created
  + resource

... (truncated)
```

</details>

*Pushed by: @constantinious*